Revit 2024 API
UpdaterData.GetDocument Method
 Returns document associated with this UpdaterData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public Document GetDocument()
Visual Basic
Public Function GetDocument As Document
Visual C++
public:
Document^ GetDocument()
See Also
UpdaterData Class
Autodesk.Revit.DB Namespace